// Необходимо создать html-страницу, в которой подключить
// файл js (его необходимо создать рядом с html-файлом). В js-файле необходимо
// создать следующий скрипт:
// Cоздать функцию greeting, которая принимает имя и выводит приветствие, используя
// переданное имя, в консоль.
// Необходимо у пользователя запросить имя и вызвать функцию greeting, 
// передав туда данное значение.



const yourName = prompt("Как Вас зовут? ");
/**
 * greeting принимает введенное пользователем имя и выводит приветствие, 
 * используя переданное имя, в консоль
 * @param {string} 
 * @returns {string}
 */
function greeting(yourName) {
    const message = "Здравствуйте, " + yourName + "!";
    console.log(message);
}
greeting(yourName);
